package com.hillel.qa.java.branching.homework;

public class HomeWork3 {
    /**
     * <h1>Вимоги</h1>
     * <p style="font-size:12px">
     * 1. Оплата за товар проводитиметься способами:
     * <br>
     * - готівкою, додаткова комісія не стягується;
     * <br>
     * - карткою, стягується додаткова комісія 2% від суми купівлі.
     * <br>
     * - за рахунком, стягується додаткова комісія 5% від суми купівлі.
     * <br>
     * 2. Сума купівлі (призначити самостійно) сплачена карткою.
     * <br>
     * 3. Виведіть суму для оплати (сума купівлі з урахуванням суми комісії).
     * <br>
     * 4. Врахуйте варіанти виведення, коли немає відповідності будь-якому способу оплати.
     * <br>
     * 5. Завдання необхідно виконати за допомогою switch case
     * </p>
     */
    public static void main(String[] args) {
        int purchaseAmount = 102; // Сума яку сплатили
        int price = 100 ;   // Ціна товара


        switch (102) {
            case 100 :
                System.out.println("Сплатили готівкою");
                break;
            case 102 :
                System.out.println("Сплатили карткою");
                break;
            case 105 :
                System.out.println("Сплатили з рахунку");
                break;
            default:
                System.out.println("Немає відповідності будь-якому способу оплати");

        }


    }
}
